{
  "fr": {
    "welcome": "Bienvenue",
    "description": "Ceci est une description en français",
    "home": "Accueil",
    "about": "À propos",
    "skills": "Compétences",
    "portfolio": "Portfolio",
    "contact": "Contact",
    
    "yo": "Salut !",
    "presentation": "Je m'appelle Danih Stephane",
    "engineer": "Ingénieur",
    "developer": "Développeur",
    "coder": "Codeur",
    "get_in_touch": "Entrer en contact",
    
    "years_of_experience": "Années d'expérience",
    "completed_projects": "Projets terminés",
    "happy_clients":"Clients satisfaits",
    
    "about_me": "à propos de moi",
    "title_introduction": "En quête d'une solution web performante et innovante ? Ensemble, donnons vie à vos idées !",
    "introduction": "Salut 👨‍💻, Je suis Danih Stéphane Rakotoarison Harilanto, développeur confirmé avec plus de 3 ans d'expérience dans le développement d'applications web et mobiles. Animé par une passion pour les technologies de l'information et leur évolution perpétuelle, j'ai contribué à des projets variés, notamment dans les solutions SaaS et les services cloud.\n Mon expertise s'étend du développement full stack à la collaboration avec des équipes créatives, favorisant l'innovation à chaque étape du processus. Transformer des idées en solutions concrètes et créatives est au cœur de mon approche, tout en restant curieux d'apprendre de nouveaux outils et concepts.\n Que ce soit en solo ou au sein d'une équipe, je privilégie la gestion efficace des projets, le suivi des méthodologies agiles et la communication ouverte, pour garantir la réussite des projets.",
    "hire_me": "Embauchez-moi",
    "download_cv": "Telecharger CV",
    
    "my_skills": "Mes compétences",
    "title_skills": "Quels sont les éventails de mes compétences techniques en développement ?",
    "skills_desc": "Voici les compétences techniques et les outils de développement qui me permettent de transformer des concepts en applications web fonctionnelles et intuitives, alliant maîtrise des langages de programmation, frameworks modernes et environnements de développement optimisés",
    "skills_button": "Compétences",
    "tools_button": "Outils",
    
  
    "my_experiences": "Mes contributions professionnelles",
    "experience_title": "Plus de 3 ans d'expérience en entreprise avec une forte implication dans des projets personnels",
    "experience_introduction": "J’ai eu l’opportunité de travailler sur divers projets, principalement dans le domaine des solutions SaaS et des services cloud. Au cours de ces expériences, j'ai été impliqué dans plusieurs tâches et responsabilités, allant du développement de fonctionnalités spécifiques à l'optimisation de l'architecture des systèmes. Cette immersion m'a permis d'acquérir une solide compréhension des défis techniques et des meilleures pratiques associés à ces environnements dynamiques.",
    
    "june_2023_present" : "Juin 2023 - Présent",
    "first_box_title": "Gestion de données avec ETL",
    "first_box_description": "Extraction : \n Intégration de données variées (CSV, SQL). \n Extraction planifiée et régulière des données. \nPrétraitement pour corriger et normaliser les formats. \n \n Transformation : \n Application de transformations complexes via des pipelines. \n Nettoyage et enrichissement des données. \n Création de nouvelles features à partir des données brutes. \n \n Chargement : \n Stockage des données dans un entrepôt central. \n Disponibilité des données pour analyse et visualisation.",
    "techno": "Technologies",
    
    "june_2022_june_2023": "Juin 2022 - Juin 2023",
    "second_box_title" : "Optimisation d'une SaaS",
    "second_box_description": "Amélioration de l'application web de gestion des données afin d'améliorer l'efficacité et la précision de la collecte statistique. Ce projet vise à intégrer des fonctionnalités avancées pour faciliter la saisie, le traitement et l'analyse des données, tout en garantissant une interface utilisateur intuitive et conviviale.",
    "specifications" : "Spécifications",
    "specifications_descriptions": "Gestion de projet pour la collecte : base de données, interface avec l'écosystème client, encaissement des chèques, ciblage marketing, et datavisualisation.",
    
    "feb_2022_mai_2022": "Fébr. 2022 - mai 2022",
    "third_box_title": "Révision d'une Interface de Saisie de Données",
    "third_box_description": "Correction et amélioration d'un outil de saisie de données, intégrant des validations avancées, la possibilité d'importer des fichiers, l'exportation des données traitées, et la gestion des utilisateurs avec des droits d'accès.",
    
    "aug_2021_des_2021": "Août 2021 - Déc 2021",
    "fourth_box_title": "Développeur Java",
    "fourth_box_description": "Mobile Banking, application android native, améliore l'accessibilité et la commodité des services bancaires, permettant aux utilisateurs de gérer leurs finances à tout moment et de n'importe où.",
    "characteristics": "Caractéristiques",
   
   
   "my_education": "Mes antécédents éducatifs",
   "education_title": "Comment un voyage éducatif peut-il mener à l'excellence en technologie ?",
   "education_description": "Au cours de mon parcours scolaire en développement informatique, j'ai eu l'opportunité d'obtenir une maîtrise dans l'une des meilleures universités d'Europe, où j'ai approfondi mes connaissances théoriques et pratiques. Cette expérience m'a permis de renforcer mes compétences en développement d'applications, tout en bénéficiant d'une solide formation en informatique dispensée par des universités locales. Parallèlement, j'ai acquis une base rigoureuse en mathématiques, essentielle pour la résolution de problèmes complexes et l'optimisation des algorithmes, me préparant ainsi à relever les défis techniques du secteur.",
   

   "education_first_box_title": "Université Côte d'Azur",
   "education_first_box_description": "Master, Ingénierie informatique. Parcours Mobiquité, Big Data et intégration de Systèmes (MBDS)",
    
   "license":"Licence",
   "education_second_box_title": "IT Univesity",
   "education_second_box_descirption": "Licence, Technologies de l''information. Spécialisé dans le développement d'applications ou la programmation.",
   
   "academic":"Académique",
   "education_third_box_title":"Faculté des sciences mathématiques",
   "education_third_box_description": "Analyse, Algèbre, Géométrie, Logique et Méthodes, Probabilités et Statistiques.",
   
   "intensive_courses": "Cours intensifs",
   
   "languages": "Languages",
   "malagasy": "Malgache (MG)",
   "french": "Français (FR)",
   "french_desc": "/ 2ème native",
   "english": "Anglais (EN)",
   "english_desc": "Compétence professionnelle",
   "german": "Allemand (DE)",
   "german_desc": "Débutant",
   
   "my_works": "Mes travaux",
   "my_works_title": "Des solutions innovantes qui défient les attentes : Mes Projets",
   "my_works_introduction": "Conception de sites Web d'exception alliant fonctionnalité et esthétique, garantissant une utilité à long terme pour les utilisateurs. Élaboration d'une interface soigneusement conçue, claire et bien documentée, veillant à la fluidité et à l'intuitivité de chaque interaction. Objectif de création de solutions élégantes répondant aux besoins actuels des clients et les préparant pour l'avenir.",
   "load_more_work": "Charger plus de travail",
   "recommandation_title": "Recommandations de Mes Collaborateurs",
   "recommandation_introduction":"Dans le cadre de ma recherche de nouvelles opportunités professionnelles, je souhaite partager avec vous les recommandations de mes collaborateurs et mentors. Leurs commentaires témoignent de mes compétences, de mon éthique de travail et de ma capacité à collaborer efficacement en équipe. Chaque témoignage reflète une expérience unique, mettant en lumière les qualités qui font de moi un candidat idéal pour un poste en tant que développeur.",
   "recommandation_conclusion": "Vous pouvez ajouter des recommandations sur LinkedIn",
   "contact_title": "Avez-vous une idée ou un projet ?  N'hésitez pas à me laisser un message !",
   "contact_desc": "Pour toute assistance, n'hésitez pas à me contacter et à me faire savoir comment je peux vous aider. Remplissez le formulaire, et je vous répondrai dans les plus brefs délais.",
   "address": "Adresse",
   "phone": "Téléphone",
   "name": "Nom",
   "ex_name": "ex. Jules Dupont",
   "ex_email": "ex. jules.dupont@gmail.com",
   "optional": "(Optionelle)",
   "write_a_message": "Ecrire un message",
   "send": "Envoyer",
   "proundly":"Conçu avec passion, propulsé par l'innovation"
   
    
    
    
    
  },
  "en": {
    "welcome": "Welcome",
    "description": "This is a description in English",
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "portfolio": "Portfolio",
    "contact": "Contact",

    "yo": "Hi",
    "presentation": "My name is Danih Stephane",
    "engineer": "Engineer",
    "developer": "Developer",
    "coder": "Coder",
    "get_in_touch": "Get in touch",
    
    "proundly":"Crafted with Passion, Powered by Innovation"
  }
}







